app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "role", "description", "sex", "location", "created_at", "updated_at", "user_id", "lat", "lng") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @post = current_user.posts.new(post_params)

    if @post.save